# # for , while
# # num=5
# # for num in range(5):
# #      print('Hello workd')
# # for num in range(1,101):
# #     print(num)
# # users=["Beka", "Beku","Bektemur","Beknazar","Bekbolot"]
# # for name in users:
# #     print(f"good{name}") 
# # name="Geeks"
# # for i in name:
# #     print([i])
# # for i in range(1,6):
# #     print(f"{i}- 0")
# # n=0
# # while True:
# #     n+=1
# #     print(n)






# ДОП ДЗ:
	
# 7 Создайте бесконечный цикл. Запросите у пользователя его возраст. Если ему есть 18 лет, выведите: "Доступ разрешен" и остановите цикл,
# иначе "Извините, пользование данным ресурсом только с 18 лет" и запросите заново.

# 1. **Неизменяемость кортежей:** Попробуйте изменить один из элементов созданного в предыдущих задачах кортежа. Объясните, почему это приводит к ошибке, и предложите альтернативный способ достижения того же результата.

# 2. **Вложенные кортежи:** Создайте кортеж, содержащий другие кортежи. Затем напишите код для извлечения элемента из внутреннего кортежа.
# 	po9000000000
