# Задание.1 Создайте вручную список из 15 элементов (название городов, музыки, машины). Сделайте срез от 2-го индекса до 7-го
# list= ["Ош","Бишкек","Чуй","Лондон","Москва","Дубай","Феррари","Ауди","Мерседес","Жентра","Нексия","Ноокат","Араван","Ниссан","Тойота"]
# print(list[2:8])

# Задание.2  Создайте вручную список из чисел и выведите их в обратном порядке
# numbers=[3,4,1,-5,7,12]
# print(numbers.reverse())
# print(numbers)

# Задание.3 Даны два списка, удалите все элементы первого списка из второго, то есть дубликаты.
# list_1 = [1, 3, 4, 5] 
# list_2 = [4, 5, 6, 7]
# result = list_1 + list(set(list_2) - set(list_1))
# print(result)  

# Задание.4  Найдите наименьший элемент в списке из задания 
# numbers=[3,4,1,-5,7,12]
# numbers.sort()
# print(numbers[0])

# Задание.5 Удалите все элементы из списка, созданного в задании 2
# numbers=[3,4,1,-5,7,12]
# numbers.clear()
# print(numbers)

# Задание.6 Найдите сумму элементов списка из задания 2
# numbers=[3,4,1,-5,7,12]
# sum=0
# for i in range(0,len(numbers)):
#     sum=sum+numbers[i]
# print(f"сумма списка  :{sum}")

# Задание.7 Найдите среднее арифметическое элементов списка из задания 2
# numbers=[3,4,1,-5,7,12]
# sum=0
# for i in range(0,len(numbers)):
#     sum=sum+numbers[i]
# print(f"сумма списка  :{sum/2}")

# Задание.8 Создайте плейлист из 10 любимых песен, поменяйте 4-й с 8-м и выведите на экран весь плейлист
# list=["a","b","c","d","first","f","g","h","second","j"]
# list[4],list[8]=list[8],list[4]
# print(list)

# Задание.9 Выясните сколько раз цифра 110 встречается в списке
# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215,
# 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110]
# print(numbers.count(110))

# Задание.10    1. **Создание кортежа:** Создайте кортеж, содержащий названия трех ваших любимых фильмов.
# my_tuple=("first film", "second film","third film")
# print(my_tuple)

                #2. **Извлечение элементов:** Используя индексацию, извлеките второй элемент из кортежа, созданного в предыдущей задаче, и выведите его.
# my_tuple=("first film", "second film","third film")
# print(f'второй элемент из кортежа :{my_tuple[2]}')

                #3. **Объединение кортежей:** Создайте два кортежа, содержащих ваши любимые цвета и животных. Затем объедините их в один кортеж.
# one_tup=("white","green","red","ellow","black")
# two_tupe=("dog","cat","cow","snake","hours")
# sum_tuple=one_tup+two_tupe
# print(f'результат двух кортежа :{sum_tuple}]')

                #4. **Длина кортежа:** Создайте кортеж из пяти чисел и определите его длину.
# one_tup=("white","green","red","ellow","black")
# tup=len(one_tup)
# print(f'длина кортежа : {tup}')

                #5. **Сравнение кортежей:** Создайте два кортежа с числами и проверьте, равны ли они друг другу.
# test_tup1 = (10, 4, 5) 
# test_tup2 = (13, 5, 18)  
# res = all(x == y for x, y in zip(test_tup1, test_tup2))  
# print(" котежы равны (да это true,нет это false? : " + str(res)) 

#Задача 2: Преобразование строки в целое число
# str= input('введите слова :')
# try:
#     print(num=int(str))
# except:
#     print("слова не преобразовать на целое число!")

#Задача 3: Доступ к элементу списка
# try:
#     list=[2,7,5,3,9,12]
#     num=int(input('введите номер индекса :'))
#     print(list[num])
# except:
#     print('введенное индекс за предели ожидаемого :')

#Задача 4: Извлечение ключа из словаря
# try:
#     key=input('введите ключ словаря :')  
#     one = any_dictionary[key]
#     print(one)
# except:
#      print("Элемент не найден")

#Задача 4: Преобразование строки в число с плавающей запятой
# str= input('введите слова :')
# try:
#     print(num=float(str))
# except:
#     print("слова не преобразовать плавающей запятой!")

# д/з Создайте бесконечный цикл. Запросите у пользователя его возраст...
# number=0
# while number <18:
#     number= int(input('введите возраст:'))
#     print('Извините, пользование ресурсом только с 18 лет')
# print("Доступ разрещен")

#   1. **Неизменяемость кортежей:** Попробуйте изменить ...
# my_tuple=('ellow','red','blue','black','white')
# #my_tuple.append('orange') # кортеж на добавляет элемент
# new=list(my_tuple)
# new.append('orange')
# my_tuple=tuple(new)
# print(my_tuple)

#2. **Вложенные кортежи:** Создайте кортеж,
# one_tuple=('dog','cat','elepant')
# my_tuple=('ellow','red','blue',*one_tuple,'black','white')
# try:
#     num=int(input('укажите индекс любого элемента из кортежа :'))
#     print(my_tuple[num])
# except:
#     print('такого индекса не существует')

