# 1) Создайте две переменные, num1 со значением 5 и num2 со значением 10. Сложите эти переменные и выведите результат на экран.
# num1=5
# num2=10
# print(num1+num2)

# 1) Создайте две переменные, num1 со значением 5 и num2 со значением 10. Сложите эти переменные и выведите результат на экран.
# num1=10
# num2=5
# print(num1-num2)

#3) Создайте две переменные, num1 со значением 20 и num2 со значением 5. Умножьте переменную num1 на переменную num2, а затем разделите результат на 2. Выведите полученный результат на экран. 
# num1=20
# num2=5
# print(num1*num2/2)

#4) Создайте три переменные, x со значением 10, y со значением 5 и z со значением 2. Вычислите результат выражения (x + y) * z и выведите его на экран. 
# x=10
# y=5
# z=2
# print((x+y)*z)

# 5) строки  strings:
# name=input('Введите строку : ')
# print(len(name), name[0])

# 6) Мини калькулятор:
# s1=int(input('Введите первое число :'))
# s2=int(input('Введите второе число :'))
# print(f"сумма: {s1+s2}, разница: {s1-s2}, сложение: {s1*s2}, частное: {s1/s2}")

# Доп задание
# num1=5
# num2=10
# print(f"num1<num2 -{num1<num2}, а num1>num2 -{num1>num2}")
