# Задание 1:
# Создайте класс Fruits c атрибутами - (name, color, weight)
# Создайте три объекта класса и с помощью метода выведите информацию о каждом фрукте 
# class Fruits:
#     def __init__(self,name,color,weight):
#         self.name=name
#         self.color=color
#         self.weight=weight
#     def Display_info(self):
#         print(f'название: {self.name} цвет: {self.color} вес: {self.weight}')

# apple=Fruits('apple ','red ','3kg ')
# apple.Display_info()
# banana=Fruits('banana ','ellow ','5kg ')
# banana.Display_info()
# kiwi=Fruits('kiwi ','green ','6kg ')
# kiwi.Display_info()

# Задание 2:
# Создайте класс Book с атрибутами title (название), author (автор) и pages (количество страниц). 
# Добавьте метод check_pages, который будет выводить сообщение о том, является ли книга тонкой (менее 100 страниц), средней (100-300 страниц) или толстой (более 300 страниц).
# class Book:
#     def __init__(self,title,author,pages):
#        self.title= title
#        self.author=author
#        self.pages=pages
#     def Display_info(self):
#         print(f'название книг: {self.title}, автор книг: {self.author}, страницы: {self.pages}')
#         if self.pages<100:
#             print('книга тонкая')
#         if self.pages<300:
#             print('книга средней тонкости')
#         else:
#             print('книга толстая')

# # apple=Book('Белый корабль','Чингиз Аитматов',500)
# # apple.Display_info()



